[
  {
    "path": "posts/2025-03-31-congratulations-to-jordan-hooker-for-his-succsseful-ms-defense/",
    "title": "Congratulations to Jordan Hooker for his successful M.S. defense",
    "description": "Jordan Hooker successfully defended his M.S. thesis titled \"Harnessing sensor technologies and machine learning for monitoring behavioral and productive indicators in dairy cows\" On Last Friday, March 28th.",
    "author": [
      {
        "name": "Anderson Alves",
        "url": {}
      }
    ],
    "date": "2025-03-31",
    "categories": [
      "Defenses"
    ],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-03-31-congratulations-to-jordan-hooker-for-his-succsseful-ms-defense/cover.jpg",
    "last_modified": "2025-03-31T14:09:08-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2024-06-09-new-paper-on-mortality-monitoring/",
    "title": "Recent paper published on Broiler mortality monitoring with Machine Learning",
    "description": {},
    "author": [
      {
        "name": "Anderson Alves",
        "url": "https://alveslab.org"
      }
    ],
    "date": "2024-06-09",
    "categories": [
      "Recent Papers"
    ],
    "contents": "\r\nWe are thrilled to announce that our latest research on monitoring mortality in broiler chickens using features extracted from feeding behavior time-series has been published in  Computers and Electronics in Agriculture.\r\nIn this study, we explored the integration of machine learning (ML) techniques with feeding behavior (FB) time series data to predict mortality events (animals culled or found dead) in floor-raised broilers. Our dataset included 2,667,617 daily observations for eight FB traits from 95,711 birds across 146 feeding trials. After data cleaning, the class distribution was 93.7 % healthy birds and 6.3 % withdrawn birds (culled or found dead), coded as 0 and 1 respectively. Mortality predictions were made one or three days before the observed events. Time series data for different FB traits were utilized to extract 22 time series features per trait, creating a structured feature dataset (days in the feeding trial + 128 time series features). We compared different ML algorithms: gradient boosting machine (GBM), multilayer perceptron neural network (MLP), logistic regression (LR), random forest (RF), and support vector machine (SVM). Due to the imbalanced nature of the data, we evaluated two sampling strategies: a random under-sampling technique (RUS) and a combined strategy (RUS + SMOTE). Models were assessed using 20-fold cross-validation and an independent test set. Statistical tests indicated consistent differences in most FB traits between control and withdrawn birds at least 7 days before the event. Features derived from traits like daily feed intake, number of visited feeders, visiting activity interval, and number of meals presented high predictive importance for mortality monitoring in broilers. In the cross-validation, classifiers achieved an average (standard deviation) of up to 0.87 (0.02) for the area under the ROC curve (AUC) and 0.55 (0.03) for the area under the precision-recall curve (AUPRC). This demonstrated a significant increase in classification performance compared to a no-skill classifier. However, performance dropped notably when extending the prediction window from one to three days in advance. The performance observed in the independent set was similar to that observed during cross-validation, indicating the robustness of our approach. The RUS + SMOTE strategy slightly outperformed RUS across all methods. GBM and SVM algorithms performed best, with no significant differences between them. Additionally, comparable results could be obtained by utilizing a reduced set of features with high predictive importance in comparison with models trained on the full feature set. In summary, Our findings indicate that large-scale feeding behavior data collected from electronic feeders offer valuable insights for predicting illness-related mortality events in floor-raised broilers using machine learning methods. Further research is needed to investigate the feasibility and cost-effectiveness of such monitoring systems in commercial settings.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2024-06-09-new-paper-on-mortality-monitoring/Figure 1.jpg",
    "last_modified": "2024-06-09T16:14:37-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-11-04-new-research-on-ultrasound-analysis/",
    "title": "New seed grant awarded on ultrasound image analysis",
    "description": {},
    "author": [
      {
        "name": "Anderson Alves",
        "url": "https://alveslab.org"
      }
    ],
    "date": "2023-12-02",
    "categories": [
      "Ongoing Research"
    ],
    "contents": "\r\nThe Institute for Integrative Precision Agriculture has awarded our lab a seed grant to investigate the suitability of applying deep learning algorithms for ultrasound image analysis to support\r\nreproductive management decisions in Cattle.\r\nThe constant advances in bovine ultrasound (US) technology, including size reduction, higher level of autonomy, better image quality, and price decreases have contributed to the spread of this technology as a common diagnostic method to assist reproduction management in beef and dairy cattle. Nonetheless,\r\nacquisition, processing, and interpretation of US-based images are time-consuming, require highly trained personnel, and might present high inter- and intra-observer variability. These limitations comprise a major challenge for large-scale application of this technology in farm conditions. The use of artificial intelligence techniques could assist the systematic evaluation of US images, contributing to the automation of complex tasks such as classifying and segmenting US-based scans, or detecting objects of interest in such imagery. The implementation of deep learning (DL) algorithms for ultrasound analysis might contribute to\r\nfacilitating image interpretation, decrease misdiagnosis, and optimize workflow on the farm. In this project, we will develop computer vision systems using deep learning algorithms to process and classify ultrasound images, aiming to generate on a large scale, image-driven reproductive indicators that can be used to\r\nsupport reproductive management decisions in cattle. Hundreds of ultrasound images will be collected in beef cows during their breeding and gestation stages. A deep neural network approach called Mask-RCNN will be implemented to generate segmented areas for the regions of interest (fetus and corpus luteum). After\r\nthis preliminary step, the pixel information from the segmented regions will be fed into convolution neural networks (CNN) to predict different fetal measurements predictions based on traditional B-mode US images. Additionally, the probability of pregnancy maintenance will be predicted based on Color Doppler\r\n(CD) ultrasonography. The outcomes of the proposed project are expected to assist veterinarians and farmers in optimizing management decisions promptly, contributing to enhancing reproductive efficiency in the cattle industry.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-11-04-new-research-on-ultrasound-analysis/doppler_icon.png",
    "last_modified": "2024-06-09T16:09:54-04:00",
    "input_file": {},
    "preview_width": 272,
    "preview_height": 206
  },
  {
    "path": "posts/2023-11-03-my-first-post/",
    "title": "Meet Our New Facultuy",
    "description": "Post originally from ADS news letter",
    "author": [
      {
        "name": "Anderson Alves",
        "url": "alvesand.netlify.app"
      }
    ],
    "date": "2023-11-04",
    "categories": [
      "New hiring"
    ],
    "contents": "\r\nAnderson A. C. Alves\r\n\r\nDr. Anderson Alves will be joining the Department of Animal and Dairy Science at UGA as an Assistant Professor in Precision Livestock Science. Originally from Brazil, Dr. Alves earned his Master’s and Doctoral degrees in Animal Science and Animal Breeding and Genetics from the Federal University of Ceara (2016) and Sao Paulo State University (2019), respectively. He served as a Lecturer at the Federal Institute of Education, Science, and Technology of Maranhao (Brazil) until 2021, when he joined the University of Wisconsin-Madison to work as a Research Associate.\r\nAt UGA, Dr. Alves’s research agenda will center on harnessing sensor technologies and artificial intelligence (AI) techniques to support efficient and sustainable livestock farming, driven by non-invasive and automated methods for monitoring welfare, health, and production indicators in Dairy Cattle and other livestock species. His research group will focus on the development and application of efficient statistical learning methods and computational tools for the analysis of high-dimensional livestock data derived from different sources, including cameras, acoustic sensors, farm records, radio-frequency systems, and modern molecular information. Examples of applications include the use of computer vision systems to monitor individual behavior in dairy cows, enabling early disease prediction, estrus detection, and identification of heat stress indicators.\r\nOriginally posted at CAES Fall Newsletter\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-11-03-my-first-post/ugalogo.png",
    "last_modified": "2024-06-09T16:09:53-04:00",
    "input_file": {},
    "preview_width": 768,
    "preview_height": 1151
  }
]
